app/views/shops/show.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`shop_id` = 8
---
    <p><%= @shop.body %></p>
    <h3>いいね件数: <%= @shop.likes.count %></h3>

SELECT `users`.* FROM `users` INNER JOIN `likes` ON `users`.`id` = `likes`.`user_id` WHERE `likes`.`shop_id` = 8
---
        <div class="left-container">
          <%= c.user.email unless c.user.blank? %>