app/controllers/likes_controller.rb

    def create
        @like = current_user.likes.create(shop_id: params[:shop_id])
---
INSERT INTO `likes` (`shop_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 1, '2020-08-09 17:16:32.376228', '2020-08-09 17:16:32.376228')