app/controllers/shops_controller.rb

SELECT `shops`.* FROM `shops` WHERE (body LIKE '%コロッケ%' )
---
    def index
        @shops = Shop.all

INSERT INTO `shops` (`created_at`, `updated_at`, `user_id`, `name`, `money`, `place`, `genre`, `body`, `image`) VALUES ('2020-08-11 05:05:21.608469', '2020-08-11 05:05:21.608469', 1, 'test', 'test', 'test', 'test', 'test', 'green-tea-2356770_1920.jpg')
---
    def create
        @shop = Shop.new(shop_params)
        @shop.user_id = current_user.id
        if @shop.save

SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
    def show
        @shop = Shop.find(params[:id])

SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 2 LIMIT 1
---
    def edit
      @shop = Shop.find(params[:id])

DELETE FROM `shops` WHERE `shops`.`id` = 2
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 2 LIMIT 1
---
    def destroy
        Shop.find(params[:id]).destroy