app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`shop_id` = 2 LIMIT 1
---
  def already_liked?(shop)
    self.likes.exists?(shop_id: shop.id)